blog_on_rails/app/controllers/comments_controller.rb

    def create
        @comment =Comment.new comment_params
        @comment.post=@post
        @comment.save
---
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "iiuoiuou"], ["post_id", 42], ["created_at", "2021-10-16 03:08:31.054560"], ["updated_at", "2021-10-16 03:08:31.054560"]]

    def destroy
        @comment = Comment.find params[:id]
        @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 264], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 264]]

    def find_post
        @post = @post = Post.find_by_id params[:post_id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]