blog_on_rails/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "1213"], ["body", "1313"], ["created_at", "2021-10-16 02:36:54.760314"], ["updated_at", "2021-10-16 02:36:54.760314"]]
---
    def create
        @post = Post.new post_params

        if @post.save

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
    def index
        @posts = Post.all.order(created_at: :desc)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 42]]
---
    def show
        #byebug
        @comments = @post.comments.order(created_at: :DESC)

UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "1213ukiyui"], ["body", "1313yuiyuiy"], ["updated_at", "2021-10-16 02:44:48.858281"], ["id", 1]]
---
    def update
            if @post.update post_params

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]
---
    def destroy
        if @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_post
        @post = Post.find_by_id params[:id]